Revit 2027 API
BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard Property
 Need to replace spare or space on switchboard.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReplaceSpareSpaceOnSwitchBoard { get; }
Public Shared ReadOnly Property ReplaceSpareSpaceOnSwitchBoard As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnSwitchBoard {
	FailureDefinitionId^ get ();
}
static member ReplaceSpareSpaceOnSwitchBoard : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace